"""Особый элемент
    Назовем особым элементом тот элемент, который является строкой длины 4 и при этом палиндром
    Дописать функцию, которая принимает на вход список из элементов различных типов данных и возвращает
    кортеж (индекс_вхождения_элемента, сам элемент) если такой элемент находится. Будем считать, что в списке
    гарантированно этот особый элемент один. А если в списке нет такого особого элемента, то вернет пустой кортеж

    ** прочитать, что такое палиндром
"""


def find_special_element(l: list):
    pass
