"""Количество элементов в строке
    постановка задачи:
        На вход дается строка длины от 1, до 10^5 и элемент, который в ней нужно найти.
        Необходимо дописать функцию, чтобы она возвращала количество элементов в строке. Если элемента в исходной
        строке нет, то необходимо вернуть сообщение "такого элемента нет"

    ** посмотреть предпоследний слайд презентации. Прочитать про return.g
"""


def get_count_character_string(s: str, ch: str):
    # дописать функцию
    pass  # это вы удаляете, после того, как напишите функцию (это заглушка)


# для самопроверки
if __name__ == '__main__':
    s = "abc"
    ch = "c"
    print(get_count_character_string(s, ch))
