"""Сколько пятерок на нечетных позициях
    Вы получается на вход корректное число типа int. Будем называть корректными числами только те, которые являются
    четными и строго больше нуля.
    Нужно вернуть количество пятерок в таком числе, которые стоят на нечетных позициях. Если число корректное и
    там нет пятерок на нечетных позициях, то вернуть 0. А если же число некорректное, то вернуть -1
"""


def get_count_odd_position_five(n: int) -> int:
    pass

if __name__ == '__main__':
    pass
